# Создать матрицу, найти максимальное значение матрицы.

import numpy as np

m = np.array([[1, 2, 3], [32, 3, 12], [43, 11, 2]])
print()
